YODEL REPORT (2021-09-07 22:14:00):

#+begin_src emacs-lisp :lexical t
(yodel
  :post*
  ;;adding something to the report...
  ;;@TODO: should this should be a macro
  ;; which captures the free variable yodel-args?
  (setq yodel-args (plist-put yodel-args :test "PASS"))
  (yodel-file
    :contents "test: |fail"
    :then*
    (kill-word 1)
    (insert "pass")
    (message "%s" (buffer-string))))
#+end_src

#+RESULTS:
: Running yodel in directory: /tmp/yodel-8tgWRD

STDOUT:

#+begin_src emacs-lisp :lexical t
hi
#+end_src

STDERR:

#+begin_src emacs-lisp :lexical t
(void-function fuck)
#+end_src

- emacs vesrion: GNU Emacs 28.0.50 (build 1, x86_64-pc-linux-gnu, X toolkit, cairo version 1.17.4, Xaw3d scroll bars)
  of 2021-09-04
- system type: gnu/linux
